clear all;clc;

a=[7.6         6.8        0.2        0.1

7.63        8.41        2.8        0.34

7.07 7.81        5.8        0.55

7.58        6.47        2.9        0.34

7.34        6.19        1.7        0.13

7.52        6.54        3.2        0.22

7.78        6.9        3.1        0.11

7.66        4.2        5.8        0.53

8.01        7.63        2.4        0.25

7.63        4.02        3.6        1.06

8.63        10.2        1.8        0.1

7.42        6.45        4.3        0.99

7.73        6.26        1.4        0.21

8        6.43        2.4        0.17

6.64        5.18        1.1        0.92

7.28        6.87        2.7        0.15

7.29        6.9        1.6        0.15

];

%先将excel表中的四项指标列分别定义为矩阵形式a，由a中数据导入P,D,C,N矩阵

%求出加权函数

P=a(:,1);

D=a(:,2);

C=a(:,3);

N=a(:,4);

n=size(P,1);                 %n个评价元素

m=4;                        %m个指标属性

e=[3 7 5 2];     %e为阿尔法1*m的矩阵，提前输入

d=[5 7 8 2];     %d为西格玛，与e相同

X1=zeros(1,n);

X2=zeros(1,n);

X3=zeros(1,n);

X4=zeros(1,n);

Y=zeros(1,n);%XI-X4,Y为1*n的空矩阵

for j=1:m    %m个属性

for i=1:n %n个元素

if P(i)<=e(j)

W1=0;

end

if P(i)>e(j)

W1=1-exp(((P(i)-e(j))/d(j)).^2);  %W1-W4为各指标对应的加权函数

end

X1(i)=W1*P(i);

end

for i=1:n

if D(i)<=e(j)

W2=0;

end

if D(i)>e(j)

W2=1-exp(((D(i)-e(j))/d(j)).^2);

end

X2(i)=W2*D(i);

end

for i=1:n

if C(i)<=e(j)

W3=0;

end

if C(i)>e(j)

W3=1-exp(((C(i)-e(j))/d(j)).^2);

end

X3(i)=W3*C(i);

end

for i=1:n

if N(i)<=e(j)

W4=0;

end

if N(i)>e(j)

W4=1-exp(((N(i)-e(j))/d(j)).^2);

end

X4(i)=W4*N(i);

end

end

Y=X1+X2+X3+X4%Y为一个月各元素的动态加权和
